CSI API ETABS v1
cDCoEurocode_2_2004.GetOverwrite Method
 Retrieves the value of a concrete design overwrite item.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetOverwrite(
	string Name,
	int Item,
	ref double Value,
	ref bool ProgDet
)
Function GetOverwrite (
	Name As String,
	Item As Integer,
	ByRef Value As Double,
	ByRef ProgDet As Boolean
) As Integer
Dim instance As cDCoEurocode_2_2004
Dim Name As String
Dim Item As Integer
Dim Value As Double
Dim ProgDet As Boolean
Dim returnValue As Integer
returnValue = instance.GetOverwrite(Name,
	Item, Value, ProgDet)
int GetOverwrite(
	String^ Name,
	int Item,
	double% Value,
	bool% ProgDet
)
abstract GetOverwrite :
        Name : string *
        Item : int *
        Value : float byref *
        ProgDet : bool byref -> int
Parameters
Name
Type: System.String
 The name of a frame object with a concrete frame design procedure.
Item
Type: System.Int32
 This is an integer between 1 and 37, inclusive, indicating the overwrite item considered.
Framing type
Live load reduction factor
Unbraced length ratio, Major
Unbraced length ratio, Minor
Effective length factor, Beta Major (columns only)
Effective length factor, Beat Minor (columns only)
Moment coefficient, Cm Major (not used)
Moment coefficient, Cm Minor (not used)
Nonsway moment factor, Db Major (not used)
Nonsway moment factor, Db Minor (not used)
Sway moment factor, Ds Major (not used)
Sway moment factor, Ds Minor (not used)
Correction factor depending on axial load in Nominal Curvature method, Kr Major (columns only)
Factor accounting for creep in Nominal Curvature method, KPhi Major (columns only)
Correction factor depending on axial load in Nominal Curvature method, Kr Minor (columns only)
Factor accounting for creep in Nominal Curvature method, KPhi Minor (columns only)
Coefficient depending on the distribution of first-order moment in both Nominal Stiffness and Nominal Curvature methods, c Major (columns only)
Coefficient depending on the distribution of first-order moment in both Nominal Stiffness and Nominal Curvature methods, c Minor (columns only)
Factor for contribution of reinforcement, Ks Major (columns only)
Ignore the benefit of Pu for beam design? (beams only)
Factor for contribution of reinforcement, Ks Minor (columns only)
Factor for effects of cracking, creep etc, Kc Major (columns only)
Factor for effects of cracking, creep etc, Kc Minor (columns only)
Effective creep coefficient, Phief (columns only)
Consider torsion (beams only)
Consider minimum eccentricity (columns only)
Coefficient of concrete compressive stress limit, k1
Coefficient of steel tensile stress limit, k3
Exposure class for crack control
Limiting crack width
Age at cracking of concrete, days
Type of cement
Load duration
Longitudinal Rebar Size Top
Longitudinal Rebar Size Bottom
Is Longitudinal Rebar Ribbed
Value
Type: System.Double
 The value of the considered overwrite item.
 Framing type
0 = Program Determined
1 = DC High
2 = DC Medium
3 = DC Low
4 = Secondary
 Live load reduction factor
 Value >= 0; 0 means use program determined value
 Unbraced length ratio, Major
 Value >= 0; 0 means use program determined value
 Unbraced length ratio, Minor
 Value >= 0; 0 means use program determined value
 Effective length factor, Beta Major
 Value >= 0; 0 means use program determined value
 Effective length factor, Beta Minor
 Value >= 0; 0 means use program determined value
 Moment coefficient, Cm Major
 Value >= 0; 0 means use program determined value
 Moment coefficient, Cm Minor
 Value >= 0; 0 means use program determined value
 Nonsway moment factor, Db Major
 Value >= 0; 0 means use program determined value
 Nonsway moment factor, Db Minor
 Value >= 0; 0 means use program determined value
 Sway moment factor, Ds Major
 Value >= 0; 0 means use program determined value
 Sway moment factor, Ds Minor
 Value >= 0; 0 means use program determined value
 Correction factor depending on axial load in Nominal Curvature method, Kr Major
 Value >= 0; 0 means use program determined value
 Factor accounting for creep in Nominal Curvature method, KPhi Major
 Value >= 0; 0 means use program determined value
 Correction factor depending on axial load in Nominal Curvature method, Kr Minor
 Value >= 0; 0 means use program determined value
 Factor accounting for creep in Nominal Curvature method, KPhi Minor
 Value >= 0; 0 means use program determined value
 Coefficient depending on the distribution of first-order moment in both Nominal Stiffness and Nominal Curvature methods, c Major
 Value >= 0; 0 means use program determined value
 Coefficient depending on the distribution of first-order moment in both Nominal Stiffness and Nominal Curvature methods, c Minor
 Value >= 0; 0 means use program determined value
 Factor for contribution of reinforcement, Ks Major
 Value >= 0; 0 means use program determined value
 Ignore the benefit of Pu for beam design?
0 = No
Any other value = Yes
 Factor for contribution of reinforcement, Ks Minor
 Value >= 0; 0 means use program determined value
 Factor for effects of cracking, creep etc, Kc Major
 Value >= 0; 0 means use program determined value
 Factor for effects of cracking, creep etc, Kc Minor
 Value >= 0; 0 means use program determined value
 Effective creep coefficient, Phief
 Value >= 0; 0 means use program determined value
 Consider torsion
0 = No
Any other value = Yes
 Consider minimum eccentricity
0 = No
Any other value = Yes
 Coefficient of concrete compressive stress limit, k1
 Value >= 0; 0 means use program determined value
 Coefficient of steel tensile stress limit, k3
 Value >= 0; 0 means use program determined value
 Exposure class for crack control
0 = Program Determined
1 = X0
2 = XC1
3 = XC2
4 = XC3
5 = XC4
6 = XD1
7 = XD2
8 = XS1
9 = XS2
10 = XS3
 Limiting crack width
 Value >= 0; 0 means use program determined value
 Age at cracking of concrete, days
 Value >= 0; 0 means use program determined value
 Exposure class for crack control
0 = Program Determined
1 = Class R
2 = Class N
3 = Class S
 Loading duration
0 = Program Determined
1 = Short term
2 = Long term
 Longitudinal Rebar Size Top
 Value is the index in the list of the rebar defined in the Reinforcing Bar Sizes form
 Longitudinal Rebar Size Bottom
 Value is the index in the list of the rebar defined in the Reinforcing Bar Sizes form
 Is Longitudinal Rebar Ribbed
0 = No
Any other value = Yes
ProgDet
Type: System.Boolean
 If this item is True, the specified value is program determined.
Return Value
Type: Int32
 Returns zero if the item is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim Value As Double
   Dim ProgDet As Boolean
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'create new concrete frame section property
   ret = SapModel.PropFrame.SetRectangle("R1", "4000Psi", 20, 12)
'set frame section property
   ret = SapModel.FrameObj.SetSection("8", "R1")
'set concrete design code
   ret = SapModel.DesignConcrete.SetCode("Eurocode 2-2004")
'run analysis
   System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
   ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
   ret = SapModel.Analyze.RunAnalysis
'start concrete design
   ret = SapModel.DesignConcrete.StartDesign()
'get overwrite item
   ret = SapModel.DesignConcrete.Eurocode_2_2004.GetOverwrite("8", 1, Value, ProgDet)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDCoEurocode_2_2004 Interface
ETABSv1 Namespace